<template>
  <div class="content">
    <h1>Здравствуйте, команда Заботай!</h1>
    <p> Меня зовут Арина, рада представить вам проект, разработанный как техническое задание для отбора в вашу команду.
      Ниже будут
      описаны функциональные возможности по приложения-урока как на Stepik и технологический стек, использованный при
      разработке приложения. </p>
    <h2> Функциональность </h2>
    <ul>
      <li>
        Начать 'урок' можно нажав на кнопку 'Start studying';
      </li>
      <li>
        На верхней панели отображаются шаги с обозначением типа контента;
      </li>
      <li>
        Ниже размещены слева направо: тема занятия, сколько шагов пройдено, сколько задач решено;
      </li>
      <li>
        На панели со списком шагов шаг с контентом видео, аудио и текста автоматически считаются пройденными, шаги с
        вопросами считаются пройденными только при условии успешного прохождения задания;
      </li>
      <li>
        Находясь внутри шага, возможно перейти либо на следующий шаг, либо на любой шаг из списка;
      </li>
      <li>
        На первом шаге предлагаю посмотреть видео;
      </li>
      <li>
        На втором шаге предлагаю послушать интересный подкаст про изменения в мире Frontend;
      </li>
      <li>
        На третьем шаге предлагаю ознакомиться с материалом про декларативное и императивное программирование;
      </li>
      <li>
        На шагах 4-7 предлагаю попробовать себя в задачках для развития математического и логического мышления, ответ
        вводится в поле для ответов, правильное решение отображается измением цвета шага на зеленый и надписью об
        успехе;
      </li>

    </ul>
    <h2>Технологический стек</h2>
    <ul>
      <li>
        Проект написан на JavaScript + Vue3 + VueX + Bulma;
      </li>
      <li>
        Описала компоненты с использованием hooks (created, mounted);
      </li>
      <li>
        Задействовала библиотеку VueX для создания Store;
      </li>
      <li>
        Использовала Vue Router для маршрутизации;
      </li>
      <li>
        Применила библиотеку Vue VideoPlayer для отображения видео-контента и библиотеку Vue AudioPlayer для
        воспроизведения аудио-контента;
      </li>
      <li>
        Для отображения математичсеких формул воспользовалась библиотекой Vue VueMathjax;
      </li>
    </ul>
    <button class="button is-info">
      <router-link to="/step/1"> Start studying </router-link>
    </button>
  </div>
</template>

<script>

export default {

  name: 'MainPage',
  components: {

  }
}
</script>

<style scoped>
.button a {
  color: white;
}

.content {
  margin: 31px;
}
</style>

